Virtual-Java/HoodLoader2/avr/boards.txt
##############################################################


HoodLoader2atmega8u2.name=HoodLoader2 8u2
HoodLoader2atmega8u2.build.core=arduino:arduino
HoodLoader2atmega8u2.bootloader.tool=arduino:avrdude
HoodLoader2atmega8u2.upload.tool=arduino:avrdude

# MCU properties
HoodLoader2atmega8u2.upload.maximum_size=4096
HoodLoader2atmega8u2.upload.maximum_data_size=512
HoodLoader2atmega8u2.build.mcu=atmega8u2

#general settings for all boards:
HoodLoader2atmega8u2.build.variant=HoodLoader2
HoodLoader2atmega8u2.build.board=HOODLOADER2
HoodLoader2atmega8u2.build.f_cpu=16000000L
HoodLoader2atmega8u2.vid.0=0x2341
HoodLoader2atmega8u2.pid.0=0x484E

#uploading settings
HoodLoader2atmega8u2.upload.speed=57600
HoodLoader2atmega8u2.upload.protocol=avr109
HoodLoader2atmega8u2.upload.disable_flushing=true
HoodLoader2atmega8u2.upload.use_1200bps_touch=true
HoodLoader2atmega8u2.upload.wait_for_upload_port=true

#fuses (HoodLoader2 only, not suitable for DFU)
HoodLoader2atmega8u2.bootloader.low_fuses=0xEF
HoodLoader2atmega8u2.bootloader.high_fuses=0xD8
HoodLoader2atmega8u2.bootloader.extended_fuses=0xFC
HoodLoader2atmega8u2.bootloader.unlock_bits=0x3F
HoodLoader2atmega8u2.bootloader.lock_bits=0x0F

#usb settings, manufacturer overwritten by the IDE because of the VID
HoodLoader2atmega8u2.build.vid=0x2341
HoodLoader2atmega8u2.build.pid=0x484E
HoodLoader2atmega8u2.build.usb_product="HoodLoader2 8u2"
HoodLoader2atmega8u2.build.usb_manufacturer="NicoHood"
HoodLoader2atmega8u2.build.extra_flags={build.usb_flags} -DMAGIC_KEY_POS=(RAMEND-1) -DUSB_EP_SIZE=16


#Board selection (only important for burning bootloaders)
HoodLoader2atmega8u2.menu.board.uno=HoodLoader2 Uno
HoodLoader2atmega8u2.menu.board.uno.bootloader.file=HexFiles/HoodLoader2_0_6_Uno_atmega8u2.hex
HoodLoader2atmega8u2.menu.board.mega2560=HoodLoader2 Mega
HoodLoader2atmega8u2.menu.board.mega2560.bootloader.file=HexFiles/HoodLoader2_0_6_Mega_atmega8u2.hex

# DFU fuse settings are not suitable for HoodLoader2
HoodLoader2atmega8u2.menu.board.dfu=DFU
HoodLoader2atmega8u2.menu.board.dfu.bootloader.file=HexFiles/BootloaderDFU_atmega8u2.hex
HoodLoader2atmega8u2.menu.board.dfu.bootloader.low_fuses=0xEF
HoodLoader2atmega8u2.menu.board.dfu.bootloader.high_fuses=0xD9
HoodLoader2atmega8u2.menu.board.dfu.bootloader.extended_fuses=0xF4
HoodLoader2atmega8u2.menu.board.dfu.bootloader.unlock_bits=0x3F
HoodLoader2atmega8u2.menu.board.dfu.bootloader.lock_bits=0x0F


##############################################################


HoodLoader2at90usb82.name=HoodLoader2 at90usb82
HoodLoader2at90usb82.build.core=arduino:arduino
HoodLoader2at90usb82.bootloader.tool=arduino:avrdude
HoodLoader2at90usb82.upload.tool=arduino:avrdude

# MCU properties
HoodLoader2at90usb82.upload.maximum_size=4096
HoodLoader2at90usb82.upload.maximum_data_size=512
HoodLoader2at90usb82.build.mcu=at90usb82

#general settings for all boards:
HoodLoader2at90usb82.build.variant=HoodLoader2
HoodLoader2at90usb82.build.board=HOODLOADER2
HoodLoader2at90usb82.build.f_cpu=16000000L
HoodLoader2at90usb82.vid.0=0x2341
HoodLoader2at90usb82.pid.0=0x484B

#uploading settings
HoodLoader2at90usb82.upload.speed=57600
HoodLoader2at90usb82.upload.protocol=avr109
HoodLoader2at90usb82.upload.disable_flushing=true
HoodLoader2at90usb82.upload.use_1200bps_touch=true
HoodLoader2at90usb82.upload.wait_for_upload_port=true

#fuses (HoodLoader2 only, not suitable for DFU)
HoodLoader2at90usb82.bootloader.low_fuses=0xEF
HoodLoader2at90usb82.bootloader.high_fuses=0xD8
HoodLoader2at90usb82.bootloader.extended_fuses=0xFC
HoodLoader2at90usb82.bootloader.unlock_bits=0x3F
HoodLoader2at90usb82.bootloader.lock_bits=0x0F

#usb settings, manufacturer overwritten by the IDE because of the VID
HoodLoader2at90usb82.build.vid=0x2341
HoodLoader2at90usb82.build.pid=0x484B
HoodLoader2at90usb82.build.usb_product="HoodLoader2 at90usb82"
HoodLoader2at90usb82.build.usb_manufacturer="NicoHood"
HoodLoader2at90usb82.build.extra_flags={build.usb_flags} -DMAGIC_KEY_POS=(RAMEND-1) -DUSB_EP_SIZE=16


#Board selection (only important for burning bootloaders)
HoodLoader2at90usb82.menu.board.uno=HoodLoader2 Uno
HoodLoader2at90usb82.menu.board.uno.bootloader.file=HexFiles/HoodLoader2_0_6_Uno_at90usb82.hex
HoodLoader2at90usb82.menu.board.mega2560=HoodLoader2 Mega
HoodLoader2at90usb82.menu.board.mega2560.bootloader.file=HexFiles/HoodLoader2_0_6_Mega_at90usb82.hex

# DFU fuse settings are not suitable for HoodLoader2
HoodLoader2at90usb82.menu.board.dfu=DFU
HoodLoader2at90usb82.menu.board.dfu.bootloader.file=HexFiles/BootloaderDFU_at90usb82.hex
HoodLoader2at90usb82.menu.board.dfu.bootloader.low_fuses=0xEF
HoodLoader2at90usb82.menu.board.dfu.bootloader.high_fuses=0xD9
HoodLoader2at90usb82.menu.board.dfu.bootloader.extended_fuses=0xF4
HoodLoader2at90usb82.menu.board.dfu.bootloader.unlock_bits=0x3F
HoodLoader2at90usb82.menu.board.dfu.bootloader.lock_bits=0x0F


##############################################################


HoodLoader2at90usb162.name=HoodLoader2 at90usb162
HoodLoader2at90usb162.build.core=arduino:arduino
HoodLoader2at90usb162.bootloader.tool=arduino:avrdude
HoodLoader2at90usb162.upload.tool=arduino:avrdude

# MCU properties
HoodLoader2at90usb162.upload.maximum_size=12288
HoodLoader2at90usb162.upload.maximum_data_size=512
HoodLoader2at90usb162.build.mcu=at90usb162

#general settings for all boards:
HoodLoader2at90usb162.build.variant=HoodLoader2
HoodLoader2at90usb162.build.board=HOODLOADER2
HoodLoader2at90usb162.build.f_cpu=16000000L
HoodLoader2at90usb162.vid.0=0x2341
HoodLoader2at90usb162.pid.0=0x484F

#uploading settings
HoodLoader2at90usb162.upload.speed=57600
HoodLoader2at90usb162.upload.protocol=avr109
HoodLoader2at90usb162.upload.disable_flushing=true
HoodLoader2at90usb162.upload.use_1200bps_touch=true
HoodLoader2at90usb162.upload.wait_for_upload_port=true

#fuses (HoodLoader2 only, not suitable for DFU)
HoodLoader2at90usb162.bootloader.low_fuses=0xEF
HoodLoader2at90usb162.bootloader.high_fuses=0xD8
HoodLoader2at90usb162.bootloader.extended_fuses=0xFC
HoodLoader2at90usb162.bootloader.unlock_bits=0x3F
HoodLoader2at90usb162.bootloader.lock_bits=0x0F

#usb settings, manufacturer overwritten by the IDE because of the VID
HoodLoader2at90usb162.build.vid=0x2341
HoodLoader2at90usb162.build.pid=0x484F
HoodLoader2at90usb162.build.usb_product="HoodLoader2 at90usb162"
HoodLoader2at90usb162.build.usb_manufacturer="NicoHood"
HoodLoader2at90usb162.build.extra_flags={build.usb_flags} -DMAGIC_KEY_POS=(RAMEND-1) -DUSB_EP_SIZE=16


